#include "tasks.h"

/*	Task 01. The same Numbers [совпадающие числа]
 *
 *	Даны четыре целых числа. Определите, сколько из них совпадающих.
 *	Если числа не совпадают, то необходимо возвратить ноль.  
 * 
 *	Формат входных данных [input]
 *	На вход даётся четыре целых числа в диапазоне типа int.
 *
 *	Формат выходных данных [output]
 *	Возвратите количество совпадающих чисел или ноль, если таких чисел нет.
 *
 *	[ input 1]: 7 7 7 7
 *	[output 1]: 4
 *
 *	[ input 2]: 7 7 7 8
 *	[output 2]: 3
 *
 *	[ input 3]: 7 7 8 9
 *	[output 3]: 2
 *
 *	[ input 4]: 6 7 8 9
 *	[output 4]: 0
 */

int task01(int a, int b, int c, int d) {

	int n;

	if (a == b && b == c && c == d) {
		n = 4;
	}
	else if (a == b && b == c || a == c && c == d || a == b && b == d || b == c && c == d || b == a && a == c || b == a && a == d || c == a && a == d || c == a && a == b || c == d && d == b || d == a && a == b || d == b && b == c || d == a && a == c) {
		n = 3;
	}
	else if (a == b || a == c || a == d || b == c || b == a || b == d || c == a || c == b || c == d || d == a ||  d == b || d == c) {
		n = 2;
	}
	else {
		n = 0;
	}
	return n;
}